Revit 2027 API
ExecutedEventArgs Class
The event arguments used by AddInCommandBinding's Executed event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
 Autodesk.Revit.UI.Events.ExecutedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExecutedEventArgs : CommandEventArgs
Public Class ExecutedEventArgs
	Inherits CommandEventArgs
public ref class ExecutedEventArgs : public CommandEventArgs
type ExecutedEventArgs =
    class
        inherit CommandEventArgs
    end
The ExecutedEventArgs type exposes the following members.
Properties
Name | Description
ActiveDocument |  The active document.
(Inherited from CommandEventArgs)
Cancel |  Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.
(Inherited from RevitEventArgs)
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitEventArgs)
CommandId |  The command id.
(Inherited from CommandEventArgs)
Top
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetJournalData |  Gets the journal data associated to this command (on journal playback).
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetJournalData |  Sets the journal data associated to this command (on journal playback).
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace